In [94]:
import numpy as np

In [95]:
import pandas as pd

In [96]:
s=pd.Series(np.random.random(5)) #creating
s

0    0.920364
1    0.415065
2    0.218388
3    0.741329
4    0.994788
dtype: float64

In [97]:
s[0]                    #indexing

0.9203639241924005

In [98]:
s[0:3]                  #slicing

0    0.920364
1    0.415065
2    0.218388
dtype: float64

In [99]:
s[0]=0.7777777          #updating
s

0    0.777778
1    0.415065
2    0.218388
3    0.741329
4    0.994788
dtype: float64

In [100]:
s.index=["a","b","c","d","e"]  #changing the index names
s

a    0.777778
b    0.415065
c    0.218388
d    0.741329
e    0.994788
dtype: float64

In [101]:
s["a"]

0.7777777

In [102]:
n=pd.Series(np.random.random(4),index=["a","b","c","d"])
n

a    0.226480
b    0.667430
c    0.752051
d    0.855982
dtype: float64

In [103]:
n.argmax()

3

In [104]:
n.argsort()

a    0
b    1
c    2
d    3
dtype: int64

In [105]:
n.cumsum()

a    0.226480
b    0.893910
c    1.645961
d    2.501943
dtype: float64

In [106]:
n.cumprod()

a    0.226480
b    0.151160
c    0.113680
d    0.097308
dtype: float64

In [107]:
n.max()

0.8559822984518439

In [108]:
n.min()

0.22648022911805332

In [109]:
n.median()

0.7097404244237724

In [110]:
 n.mean()

0.6254858441043605

# DATAFRAME

In [111]:
s1=pd.Series(np.random.random(5))

In [112]:
s2=pd.Series(np.random.random(5))

In [113]:
s1,s2

(0    0.361627
 1    0.364894
 2    0.837974
 3    0.083327
 4    0.862485
 dtype: float64,
 0    0.740451
 1    0.425263
 2    0.097037
 3    0.292850
 4    0.113827
 dtype: float64)

In [114]:
pd.DataFrame([s1,s2])

          0         1         2         3         4
0  0.361627  0.364894  0.837974  0.083327  0.862485
1  0.740451  0.425263  0.097037  0.292850  0.113827

In [115]:
pd.DataFrame([s1,s2],columns=["a","b","c","d","e"])

    a   b   c   d   e
0 NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN

In [116]:
d={                                                        #creating a dict with series elements
    "abc":pd.Series([1,2,3,4],index=["a","b","c","d"]),
    "xyz":pd.Series([3,4,5],index=["a","b","c"])
    
}

In [117]:
d

{'abc': a    1
 b    2
 c    3
 d    4
 dtype: int64,
 'xyz': a    3
 b    4
 c    5
 dtype: int64}

In [118]:
data=pd.DataFrame(d)

In [119]:
data

   abc  xyz
a    1  3.0
b    2  4.0
c    3  5.0
d    4  NaN

In [120]:
data.max()

abc    4.0
xyz    5.0
dtype: float64

In [121]:
l={
    
    "name":["Srikanth","suresh","ravi"],"age":[23,45,33]
}

In [122]:
x=pd.DataFrame(l)

In [123]:
x

       name  age
0  Srikanth   23
1    suresh   45
2      ravi   33

In [124]:
m={
    "name":["Bharath","Vamsi","pradeep"],"weight":[20,21,19]
}

In [125]:
y=pd.DataFrame(m)
y

      name  weight
0  Bharath      20
1    Vamsi      21
2  pradeep      19

In [126]:
x,y

(       name  age
 0  Srikanth   23
 1    suresh   45
 2      ravi   33,
       name  weight
 0  Bharath      20
 1    Vamsi      21
 2  pradeep      19)

In [127]:
x.merge(y)

Empty DataFrame
Columns: [name, age, weight]
Index: []

In [128]:
pd.concat([x,y])

       name   age  weight
0  Srikanth  23.0     NaN
1    suresh  45.0     NaN
2      ravi  33.0     NaN
0   Bharath   NaN    20.0
1     Vamsi   NaN    21.0
2   pradeep   NaN    19.0

In [129]:
import os

In [130]:
d1=pd.read_excel("D:/Datasets//Data.xlsx")    #Reading an excel file from computer

In [131]:
d1

   Unnamed: 0  country   age   salary purchased
0         NaN   france  44.0  72000.0        no
1         NaN    spain  27.0  48000.0       yes
2         NaN  germany  30.0  54000.0        no
3         NaN    spain  38.0  61000.0        no
4         NaN  germany  40.0      NaN       yes
5         NaN   france  35.0  58000.0       yes
6         NaN    spain   NaN  52000.0        no
7         NaN   france  48.0  79000.0       yes
8         NaN  germany  50.0  83000.0        no
9         NaN   france  37.0  67000.0       yes

In [152]:
d2=pd.read_excel("D:/Datasets/Data1.xlsx")

In [153]:
d2

   country   age   salary purchased
0   france  44.0  72000.0        no
1    spain  27.0  48000.0       yes
2  germany  30.0  54000.0        no
3    spain  38.0  61000.0        no
4  germany  40.0      NaN       yes
5   france  35.0  58000.0       yes
6    spain   NaN  52000.0        no
7   france  48.0  79000.0       yes
8  germany  50.0  83000.0        no
9   france  37.0  67000.0       yes

In [154]:
d2.head()

   country   age   salary purchased
0   france  44.0  72000.0        no
1    spain  27.0  48000.0       yes
2  germany  30.0  54000.0        no
3    spain  38.0  61000.0        no
4  germany  40.0      NaN       yes

In [155]:
d2.tail()

   country   age   salary purchased
5   france  35.0  58000.0       yes
6    spain   NaN  52000.0        no
7   france  48.0  79000.0       yes
8  germany  50.0  83000.0        no
9   france  37.0  67000.0       yes

In [156]:
 d2.shape

(10, 4)

In [160]:
d2["new"]= np.random.random(10)

In [161]:
d2

   country   age   salary purchased       new
0   france  44.0  72000.0        no  0.964153
1    spain  27.0  48000.0       yes  0.047839
2  germany  30.0  54000.0        no  0.333774
3    spain  38.0  61000.0        no  0.591409
4  germany  40.0      NaN       yes  0.418803
5   france  35.0  58000.0       yes  0.028644
6    spain   NaN  52000.0        no  0.121981
7   france  48.0  79000.0       yes  0.594351
8  germany  50.0  83000.0        no  0.253657
9   france  37.0  67000.0       yes  0.861129

In [162]:
d2.drop(['new'],axis=1)

   country   age   salary purchased
0   france  44.0  72000.0        no
1    spain  27.0  48000.0       yes
2  germany  30.0  54000.0        no
3    spain  38.0  61000.0        no
4  germany  40.0      NaN       yes
5   france  35.0  58000.0       yes
6    spain   NaN  52000.0        no
7   france  48.0  79000.0       yes
8  germany  50.0  83000.0        no
9   france  37.0  67000.0       yes

In [165]:
d2['salary']

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4        NaN
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: salary, dtype: float64

In [166]:
d2[d2['salary']>60000]

   country   age   salary purchased       new
0   france  44.0  72000.0        no  0.964153
3    spain  38.0  61000.0        no  0.591409
7   france  48.0  79000.0       yes  0.594351
8  germany  50.0  83000.0        no  0.253657
9   france  37.0  67000.0       yes  0.861129

In [167]:
d2[d2['age']<40]

   country   age   salary purchased       new
1    spain  27.0  48000.0       yes  0.047839
2  germany  30.0  54000.0        no  0.333774
3    spain  38.0  61000.0        no  0.591409
5   france  35.0  58000.0       yes  0.028644
9   france  37.0  67000.0       yes  0.861129